const elementPath = document.querySelector('.test')
const trigger = document.querySelector('#PW')
const path ="                <svg xmlns=\"http://www.w3.org/2000/svg\" xml:space=\"preserve\"\n" +
    "                     style=\"enable-background:new 0 0 100 103.94\" viewBox=\"0 0 100 103.94\"><path d=\"M0 88.42s4.85-3.88 11.54-5.08c0 0 6.45-1.46 8.3-2.81s4-1.87 5.46-8.12c.86-3.67-.3-7.97-.43-8.53s-2.11-9.1-2.26-10.23c-.15-1.13-1.01-8.66 2.11-12.4 1.04-1.25 2.85-2.28 4.19-.69 1.35 1.58 5.14 6.99.97 12.09-.91 1.11-4.16 2.9-7.98-6.53-.77-1.89-1.47-7.28 2.48-9.79 2.08-1.33 4.78-2.22 8.1 1.12s4.5 9.91 3.03 15.24c-.43 1.55-4.18 11.77-10.72 13.51-.72.19-10.75-.11-13.4-16.69-.62-3.89.4-11.83 3.18-12.61 2.79-.78 8.15 7.61 4.66 9.25-5.9 2.76-4.58-9.25-4.41-10.51.67-4.95 2.92-8.29 3.72-9.76.8-1.47 4.12-7.75 10.43-12.27 2.81-2.02 8.51-4.99 10.83-5.46-3.76-.01-8.5 2.3-10.51 3.25 0 0-7.2 2.76-12.48 13.23-.51 1.02-2.03 5.46-2.03 5.46s.27-4.34 1.27-6.97 6.93-12.45 15.22-16.84c1.22-.65 4.98-3.1 9.09-4.37 3.16-.97 8.24-1.67 8.8 1.23s-3.52 5.9-4.5 4.92S46.68 3.9 50 2.85 60.63-.07 66.87.42 84.73 1.9 93.78 12.1c.9 1.02 5.75 7.35 5.75 14.99 0 1.61-.29 9.07-2.29 11.34-.73.83-2.9-2.63-5.08-4.01s-8.64-6.33-29.63-8.51c0 0-5.66-.13-7.11.31-1.45.45-9.13 3.14-11.29 2.16-2.16-.98-4.23-4.03-2.65-8.64 1.58-4.61 3.32-6.39 3.56-7.4s.71-2.43-.29-2.65c-1-.22-5.86.62-7.98 2.09s-6.46 3.19-13.54 11.99c-2.48 3.08-4.95 8.91-4.9 11.14.04 2.23.18 2.16.98 2.36.8.2 3.23-2.52 3.7-4.68.47-2.16 2.81-8.57 6.17-12.18 4.34-4.68 9.16-8 11.25-8.24s-.93 2.88-1.31 3.25c-.62.61-4.92 3.72-7.31 10.34-.81 2.26-.48 8.83 4.75 9.2s10.87-2.05 10.87-2.05 6.42-2.56 10.56-2.52c4.14.04 9.22-.45 20.36 2.61 2.97.81 14.55 5.16 15.57 7.97 1.02 2.81-2.41 3.75-2.41 3.75s-5.9 2.65-10.65 2.32-8.16-.45-8.95-2.34c-.79-1.89-.44-4.7 1.67-5.52s-.41 3.19-1.17 3.45c-.76.27-3.21 1.05-4.97.65-1.76-.4-4.01-1.27-3.7-2.47.31-1.2 1.56-2.23 3.1-2.38 1.54-.16 2.53-.31 2.72.09s.22 1.27-.84 1.74-4.02 1.31-7.08 1.51c-3.05.2-12.22.26-15.95-.8-3.73-1.06-6.63-2.09-7.75-7.95-.33-1.72 1.23-2.67 2.12-2.83.89-.16 2.94.67 4.32 1.58s8.13 6.35 11.65 6.73 2.87.28 4.37.23 6.95-2.61 7.64-2.77c.69-.16 3.24-.57 4.3-.4 1.23.2 3.68.55 3.88 3.36.2 2.81-2.16 4.28-2.29 4.41-.13.13-4.63 2.38-4.79 2.56-.16.18-1 .49-.85.91.16.42.84.58 1.28.58s1-.09 1.17-.45c.18-.35-.4-1.13-.65-1.18-.25-.04-1.33-.62-2.98-.53-3.36.18-4.84 1.6-5.06 1.83-.22.22-1.69 1.85-1.89 1.94-.2.09-1.2.94-2.16.58-.96-.36.25.87.71 1.07.47.2 1.72.27 2.9-.09s4.28-.8 4.61-.78 3.21.27 3.68.47c.47.2 1.93 1.28 2.2 1.77.34.6.6 1.51.18 1.92-.42.41-1.46.28-1.85.28s-7.17-.98-7.61-1.23-1.16-.61-1.11-.97c.04-.36.74-1.9 1.83-2.57 1.09-.67 2.23-.89 3.43-.82 1.2.07 3.72.47 4.66 1.14.94.67 1.14 1.02 1.14 1.02s.29-.42.2-1.09c-.09-.67-.79-2.14-.6-2.07.71.25 1.14.82 1.36 1.09s1.34 2.38 1.05 4.3c-.29 1.92-.45 3.05-2.21 4.95-.33.35-2.14.69-3.14.16-1-.54-1.23-.85-1.02-.99s.95-.61 2.04-.34 1.9.6 2.63 1.65c.74 1.05 1.76 2.61.82 6.75-.19.85-1.69 2.92-3.23 3.21s-3.88.56-6.73-.02-7.34-1.39-15.86-4.3c-.82-.28-9.02-3.3-10.85-5.86-.53-.75.27.8.6 1.23.33.42 2.87 3.32 9.71 5.84.78.29 7.44 3.01 16.98 4.92.6.12-1.16.21-1.45.67-.29.45-2.18 1.16-2.43 5.1-.25 3.94.64 11.26-.26 13.63-.9 2.37-2.31 5.82-4.82 6.84-2.51 1.03-4.88 3.1-14.52 2.6-2.43-.12-11.67-1.82-16.31-6.84-.53-.58-5.05-4.43-7.47-9.67-.59-1.29-1.73-5.99.86-6.43 2.58-.43 2.29 2.87 2.29 2.87s.58 6.67 1.94 9.3c1.36 2.63 3.62 9.3 10.59 12.86 5.44 2.78 11.55 3.16 17.38 2.18s12.43-3.81 15.33-9.01c.65-1.17 1.71-4.07 1.42-6.21s-1.31-2.8-2.08-3.02c-2.13-.63-3.02.8-2.16 2.07.61.91 3.57 2.52 5.95 2.94s7.66-.93 16.83 1.97c2.44.77 6.07 1.91 11.96 9.86\" style=\"fill:none\" stroke=\"url(#gradient)\"/>\n" +
    "                    <linearGradient id=\"gradient\">\n" +
    "                        <stop offset=\"30%\" stop-color=\"#01979B\"></stop>\n" +
    "                        <stop offset=\"60%\" stop-color=\"#0D5E6B\"></stop>\n" +
    "                        <stop offset=\"100%\" stop-color=\"#562E90\"></stop>\n" +
    "    </linearGradient>\n" +
    "                </svg>"


 window.addEventListener('scroll' , addPath)
 //window.addEventListener('scroll' ,  handleAddImage)

function  handleAddImage(){
    if(trigger.classList.contains('appearance-active')){
        addImage()
        console.log('addImage работает')
    }
}


function addImage(){
    elementPath.innerHTML += "<h1>GGGGG</h1>";
    console.log( "addPath работает")
}

function addPath(){
    const elementPathHeight = elementPath.offsetHeight;
    const elementPathOffset = offset(elementPath).top;
    const pathAddStart = 4;

    let elementPathAddPoint = window.innerHeight - elementPathHeight / pathAddStart;

    if(elementPathHeight > window.innerHeight){
        elementPathAddPoint = window.innerHeight - window.innerHeight / pathAddStart;
    }

    if((pageYOffset > elementPathOffset - elementPathAddPoint ) && pageYOffset < (elementPathOffset + elementPathHeight )){
        // elementPath.insertAdjacentHTML = ("afterBegin", "<img src=\"./images/plastic-world.svg\" alt=\"Total keto diet\">");
       // elementPath.insertAdjacentHTML = ("beforeBegin", "<h1>GGGGGG</h1>")
        elementPath.innerHTML += path;
        elementPath.style.opacity = "1";
        console.log( "addPath работает")
        console.log( elementPath.style.opacity)
        window.removeEventListener('scroll', addPath)
    }

    function offset(el) {  //кроссбрауузерно получает значение сверху и слева
        const rect = el.getBoundingClientRect(),
            scrollLeft = window.pageXOffset || document.documentElement.scrollLeft,
            scrollTop = window.pageYOffset || document.documentElement.scrollTop;
        return {top: rect.top + scrollTop, left: rect.left + scrollLeft,}
    }
}

console.log (elementPath)